In [1]:
file = open('data.csv','x')
file.close()

In [2]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn    name  age    address
0   1     Ram   45  Kathmandu
1   2   Shyam   89   Lalitpur
2   3   Sabin   45      Jhapa
3   5   Akash   34    Chitwan
4   6  Surest   78       Bara

In [4]:
import pandas as pd
df = pd.read_csv('data.csv')
# df.head()
df.head(3)

   sn   name  age    address
0   1    Ram   45  Kathmandu
1   2  Shyam   89   Lalitpur
2   3  Sabin   45      Jhapa

In [5]:
df.tail(3)

   sn    name  age  address
2   3   Sabin   45    Jhapa
3   5   Akash   34  Chitwan
4   6  Surest   78     Bara

In [7]:
# !pip install pandas

In [11]:
df = pd.read_csv('data.csv',index_col = 'sn')
df

      name  age    address
sn
1      Ram   45  Kathmandu
2    Shyam   89   Lalitpur
3    Sabin   45      Jhapa
5    Akash   34    Chitwan
6   Surest   78       Bara

In [10]:
df = pd.read_csv('data.csv',index_col = 'sn',usecols = ['sn','name','age'])
df

      name  age
sn
1      Ram   45
2    Shyam   89
3    Sabin   45
5    Akash   34
6   Surest   78

In [13]:
#iloc and loc
df.iloc[1:4]

     name  age   address
sn
2   Shyam   89  Lalitpur
3   Sabin   45     Jhapa
5   Akash   34   Chitwan

In [20]:
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['Shyam':'Akash']

       sn  age   address
name
Shyam   2   89  Lalitpur
Sabin   3   45     Jhapa
Akash   5   34   Chitwan

In [24]:
df = pd.read_csv('data.csv',index_col = 'sn')
df['name']

sn
1       Ram
2     Shyam
3     Sabin
5     Akash
6    Surest
Name: name, dtype: object

In [26]:
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['name'] == 'Ram']

   name  age    address
sn
1   Ram   45  Kathmandu

In [29]:
df = pd.read_csv('data.csv',index_col = 'sn')
df = df[df['age'] > 50]
df.to_csv('new_data.csv')

In [31]:
data = {'name':['Ram','Shyam','Hari'],
       'age':[45,67,89],
       'add':['Kathmandu','Bhaktapur','Lalitpur']}
df = pd.DataFrame(data)
df.to_csv('info.csv')
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   67  Bhaktapur
2   Hari   89   Lalitpur

In [38]:
data = [['name','age','add'],
       ['Ram',45,'Kathmandu'],
       ['Shyam',34,'Bhaktapur'],
       ['Hari',67,'Lalitpur']]
import csv
file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [39]:
df = pd.read_csv('list_data.csv')
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   34  Bhaktapur
2   Hari   67   Lalitpur